Repository: doc-l10n-kit/ja-infinispan
Catalog: l10n/tmx/infinispan.tmx
Source language: en
Languages: ja_jp

source: If you are wondering how to start with Infinispan Server from your Java Application, a new https://infinispan.org/infinispan-server-tutorial/[Tutorial] is available. This tutorial covers the essentials to get started with Infinispan Server and takes around half an hour to complete.
ja_jp: JavaアプリケーションからInfinispanサーバを起動する方法を知りたい場合は、新しい link:https://infinispan.org/infinispan-server-tutorial/[チュートリアル] をご利用ください。このチュートリアルでは、Infinispanサーバを使い始めるための基本的なことを説明しており、30分程度で完了します。

source: In this tutorial you will learn how to:
ja_jp: このチュートリアルでは、以下の方法を学びます。

source: Run Infinispan Server.
ja_jp: Infinispanサーバを実行します。

source: Access and use the Infinispan Console.
ja_jp: Infinispanコンソールにアクセスして使用します。

source: Create Infinispan caches.
ja_jp: Infinispanのキャッシュを作成します。

source: Read and write data as primitive types and Java objects.
ja_jp: プリミティブ型やJavaオブジェクトとしてデータを読み書きする。

source: Add lifespans to entries so data expires.
ja_jp: データの有効期限が切れるように、エントリに寿命を追加します。

source: Deploy client listeners to get event notifications.
ja_jp: イベント通知を取得するためのクライアントリスナを配置します。

source: Search the data store for specific values.
ja_jp: データストアで特定のバリューを検索します。

source: Use out-of-the-box testing with Junit 5 for verification.
ja_jp: 検証にはJunit 5で直ぐに使えるテストを使用してください。

source: Complete the tutorial, ask us anything about it, give us feedback and feel free to share it!
ja_jp: チュートリアルを完成させて、私たちに何か質問をしたり、フィードバックをしたり、自由に共有してください。

source: As a belated surprise in your chocolate egg this year is a brand new final release. Infinispan 12.1 https://en.wikipedia.org/wiki/Taedonggang[Taedonggang] includes a bunch of new features and fixes.
ja_jp: 今年のチョコレート・エッグには、遅ればせながら真新しいファイナル・リリースが入っています。Infinispan 12.1 link:https://en.wikipedia.org/wiki/Taedonggang[Taedonggang]には、たくさんの新機能と修正が含まれています。

source: Out-of-the-box authorization in the server
ja_jp: サーバーですぐに使える認証

source: The biggest change is the fact that the server now enables authorization right from the start, including a set of predefined roles. By default this only affects management ops and it can be easily disabled.
ja_jp: 最大の変更点は、サーバーが事前に定義された役割を含めて、最初から認証を可能にしたことです。デフォルトでは、この機能は管理業務にのみ影響し、簡単に無効できます。

source: Head over to https://infinispan.org/docs/stable/titles/server/server.html#authorization for details on this feature and how to tune it to your own needs.
ja_jp: この機能の詳細と、自分のニーズに合わせて調整する方法については、 https://infinispan.org/docs/stable/titles/server/server.html#authorization をご覧ください。

source: Infinispan can now load configuration as YAML, as well as XML and JSON.
ja_jp: Infinispanは、XMLやJSONだけでなく、YAMLとして設定を読み込みこめるようになりました。

source: Soft-Index File Store
ja_jp: ソフト索引ファイルストア

source: The Soft-Index File Store (or SIFS for short) is one of our file-based stores, and it has received a number of improvements such as segmentation, non-blocking and requiring no additional threads. Additionally, if you are lucky enough to have some persistent memory hardware, this file-store can support it via the very awesome https://github.com/jhalliday/mashona[Mashona library]. We hope to make this our default file-store in the future (replacing the Single File Store).
ja_jp: ソフト索引ファイルストア（Soft-Index File Store略してSIFS）は、ファイルベースのストアの1つで、セグメント化、ノンブロッキング、追加のスレッドを必要としないなど、数多くの改良が施されています。さらに、もしあなたが幸運にも永続メモリーのハードウェアを持っているなら、このファイルストアは非常に素晴らしい link:https://github.com/jhalliday/mashona[Mashonaライブラリ]を介してそれをサポートできます。将来的には、シングルファイルストアに代わって、このファイルストアをデフォルトのファイルストアにしたいと考えています。

source: Server protocol management
ja_jp: サーバーのプロトコル管理

source: You can now enable/disable protocol endpoints at runtime or use https://infinispan.org/docs/stable/titles/server/server.html#endpoint_ipfilter[IP filtering] for fine-grained access control.
ja_jp: 稼働時にプロトコルのエンドポイントを有効/無効にしたり、 link:https://infinispan.org/docs/stable/titles/server/server.html#endpoint_ipfilter[IPフィルタリング] を使用してきめ細かなアクセスコントロールをできるようになりました。

source: The console is now fully aware of the server authorization roles (if enabled) and many fixes are included.
ja_jp: コンソールは、サーバーの認証ロールを完全に認識するようになり（有効な場合）、多くの修正が含まれています。

source: The CLI is now available as https://github.com/infinispan/infinispan-quarkus/releases[native builds] for Linux and MacOS.
ja_jp: このCLIは、LinuxおよびMacOSの link:https://github.com/infinispan/infinispan-quarkus/releases[ネイティブビルド]として提供されています。

source: You can now enable automatic Cross Site https://infinispan.org/docs/stable/titles/xsite/xsite.html#xsite_state_transfer-xsite[state transfer] for asynchronous backup strategy.
ja_jp: 非同期バックアップ戦略において、拠点横断の自動 link:https://infinispan.org/docs/stable/titles/xsite/xsite.html#xsite_state_transfer-xsite[状態移行]を有効にできるようになりました。

source: Our Spring Cache and Spring Session integration now allows user keys and values to be stored in https://infinispan.org/docs/stable/titles/developing/developing.html#configuring_protobuf_encoding-data[Protostream] format. However, full integration with the Infinispan Spring Boot Starter is landing in the next minor release. Stay tuned!
ja_jp: Spring CacheとSpring Sessionの統合により、ユーザがキーとバリューを link:https://infinispan.org/docs/stable/titles/developing/developing.html#configuring_protobuf_encoding-data[Protostream]形式で保存できるようになりました。しかし、Infinispan Spring Boot Starterとの完全な統合は、次のマイナーリリースで着地します。ご期待ください。

source: Marshalling/ProtoBuf
ja_jp: マーシャリング/ProtoBuf

source: The latest ProtoStream release 4.4.0.Beta3 includes support for marshalling arrays and collections, built-in support for several community requested types (UUID, BigDEcimal,...), a new method in ProtobufUtil for computing message size (without actually encoding the message) and a lot of bug fixes. This release also provides it’s own protobuf encoder and removes the dependency on protobuf-java artifact which was previously used for encoding the stream (without being exposed by the API).
ja_jp: 最新の ProtoStream リリース 4.4.0.Beta3 には、配列とコレクションのマーシャリングのサポート、コミュニティから要求されたいくつかの型（UUID、BigDEcimal、...）の組込みサポート、（実際にメッセージをエンコードすることなく）メッセージサイズを計算する ProtobufUtil の新しいメソッド、および多くのバグ修正が含まれています。このリリースでは、独自の protobuf エンコーダが提供され、以前はストリームのエンコードに使用されていた protobuf-java アーティファクトへの依存がなくなりました (API では公開されていません)。

source: We now provide an image containing a natively compiled version of the Infinispan CLI at quay.io/infinispan/cli
ja_jp: ネイティブにコンパイルされたInfinispan CLIのイメージをquay.io/infinispan/cliで提供しています。

source: In addition to numerous fixes, the operator has added many new features. Most notably:
ja_jp: 数々の修正に加えて、オペレーターは多くの新機能を追加しました。最も注目すべきは

source: Batch CR
ja_jp: バッチCR

source: Custom library support
ja_jp: カスタムライブラリ対応

source: Custom labels on Resources created by Operator
ja_jp: オペレータが作成したリソースのカスタムラベル

source: Disable Authentication Option
ja_jp: 認証オプションの無効化

source: Decouple user and operator endpoint authentication
ja_jp: ユーザとオペレータのエンドポイント認証を分離

source: We’ve made a lot of updates to our documentation this release, with lots more task-oriented content for new features and capabilities. Server credential stores, refactored authorization (RBAC) configuration, Operator Batch CR, Backup and Restore CRs, custom code deployments, automatic cross-site state transfer, querying values, configuring Protobuf annotations for marshalling… Hopefully you’ll find all the answers you need for using Infinispan 12.1.
ja_jp: 今回のリリースでは、ドキュメントの更新が多く行われ、新機能や性能に関する職務指向のコンテンツがたくさん追加されました。サーバ・クレデンシャル・ストア、リファクタリングされた認証(RBAC)の構成、オペレータ・バッチCR、バックアップ・リストアCR、カスタム・コード・デプロイメント、自動拠点横断状態転送、値を照会、マーシャリングのためのProtobufアノテーションの構成...Infinispan 12.1を使用するために必要なすべての答えが見つかることを願っています。

source: One of the big highlights for docs in this release are the new tabbed configuration snippets we’re going to start adding. Right now you can find an example of tabbed configuration in the REST API docs here: https://infinispan.org/docs/dev/titles/rest/rest.html#cache_configuration
ja_jp: 今回のリリースにおけるdocsの大きな特徴の一つは、タブ付き設定のスニペットを新たに追加することです。現在、REST APIのドキュメントにタブ付き設定の例があります https://infinispan.org/docs/dev/titles/rest/rest.html#cache_configuration

source: We’ve also done a lot of housekeeping in this release to make sure configuration examples are up to date and valid. In the next release you can expect to see more improvements there as well as a new title to improve our documentation around encoding and how Infinispan uses Protobuf.
ja_jp: また、このリリースでは、設定例が最新で有効であることを確認するために、多くの維持管理を行いました。次のリリースでは、エンコーディングや Infinispan がどのように Protobuf を使用するかについてのドキュメントを改善するための新しいタイトルと同様に、さらなる改善を期待できます。

source: As always, thanks for reading and get in touch if you have comments, feedback, or suggestions on our documentation.
ja_jp: いつもお読みいただきありがとうございます。また、私たちのドキュメントに関するコメント、フィードバック、提案などがありましたら、ご連絡ください。

source: You can look at the detailed https://issues.redhat.com/secure/ReleaseNote.jspa?projectId=12310799&version=12353337E[release notes] to see what has changed since CR1. If you are upgrading from a previous version of Infinispan, please checkout our https://infinispan.org/docs/stable/titles/upgrading/upgrading.html[Upgrading guide].
ja_jp: CR1からの変更点については、詳細な link:https://issues.redhat.com/secure/ReleaseNote.jspa?projectId=12310799&amp;version=12353337E[リリースノート]をご覧ください。旧バージョンのInfinispanからアップグレードする場合は、 link:https://infinispan.org/docs/stable/titles/upgrading/upgrading.html[アップグレード・ガイド]をご確認ください。

source: Our next release, 13.0, should happen during the summer, and will hopefully introduce a new API which will make using Infinispan much easier, as well as a number of other improvements across the board. As usual, look out for blog postings about upcoming highlights. If you'd like to contribute, just get in touch.
ja_jp: 次のリリースである13.0は夏頃に予定されており、Infinispanの使用をより簡単にする新しいAPIを導入するほか、全体的に多くの改良が加えられることを期待しています。いつものように、今後のハイライトについてのブログ投稿をお楽しみに。ご協力いただける方は、ぜひご連絡ください。

source: One of the key aspects of our new server architecture is the management API exposed through the single port.
ja_jp: 私たちの新しいサーバーアーキテクチャの重要な側面の1つは、単一のポートを通じて公開される管理APIです。

source: While I'm sure there will be those of you who like to write scripts with plenty of `curl/wget` magic, and those who prefer the comfort of our new web console, the Infinispan CLI offers a powerful tool which combines the power of the former with the usability of the latter.
ja_jp: `curl/wget` マジックをたくさん使ってスクリプトを書くのが好きな人と、新しいウェブコンソールの快適さを好む人がいると思いますが、Infinispan CLIは前者の力と後者の使いやすさを兼ね備えた強力なツールを提供しています。

source: During the Infinispan 11 development cycle, the CLI has received numerous enhancements. Let's look at some of them !
ja_jp: Infinispan 11 の開発サイクルの間、CLI は多くの機能強化を受けました。そのいくつかを見てみましょう

source: User management
ja_jp: ユーザー管理

source: When using the built-in properties-based security realm, you had to use the `user-tool` script to manage users, passwords and groups. That functionality has now been built into the CLI:
ja_jp: ビルトインのプロパティベースのセキュリティ領域を使用する場合、ユーザ、パスワード、グループを管理するために `user-tool` スクリプトを使用しなければなりませんでした。その機能が CLI に組み込まれました。

source: Remote logging configuration
ja_jp: リモートロギング設定

source: You can now modify the server logging configuration from the CLI. For example, to enable TRACE logging for the `org.jgroups` category, use the following:
ja_jp: これで、CLIからサーバーのロギング設定を変更できるようになりました。たとえば、 `org.jgroups` カテゴリの TRACE ロギングを有効にするには、次のようにします。

source: logging configuration changes are volatile, i.e. they will be lost when restarting a node.
ja_jp: ロギング設定の変更は揮発性で、ノードを再起動すると失われます。

source: To help with debugging issues, the server now implements an aggregate log which includes information such as a thread dump, memory configuration, open sockets/files, etc.
ja_jp: 問題のデバッグを支援するために、サーバーはスレッドダンプ、メモリ設定、開いているソケットやファイルなどの情報を含む集約ログを実装しています。

source: this feature currently only works on Linux/Unix systems.
ja_jp: この機能は現在のところ、Linux/Unix システムでのみ動作します。

source: Real CLI mode
ja_jp: リアルCLIモード

source: It is now possible to invoke all CLI commands directly from the command-line, without having to resort to interactive mode or a batch. For example:
ja_jp: インタラクティブモードやバッチに頼らずに、すべてのCLIコマンドをコマンドラインから直接呼び出すことができるようになりました。例えば、以下のようになります。

source: Native CLI
ja_jp: ネイティブCLI

source: The CLI can now be built as a native executable, courtesy of https://www.graalvm.org/[GraalVM]'s `native-image` tool. We will soon be shipping binaries/images of this, so look out for an announcement.
ja_jp: CLIは、 link:https://www.graalvm.org/[GraalVM] の `native-image` ツールの提供により、ネイティブ実行ファイルとしてビルドできるようになりました。まもなく、このバイナリ/イメージを出荷する予定ですので、発表をお楽しみにお待ちください。
